function generateEmojiCode(text) {
    const emojiStrMap = {
        0:"(ﾟｰﾟ) - (ﾟｰﾟ)", 
        1:"(ﾟΘﾟ)", 
        2:"(ﾟΘﾟ) + (ﾟΘﾟ)", 
        3:"(o ^ _ ^ o)", 
        4:"(o ^ _ ^ o) + (ﾟΘﾟ)", 
        5:"(ﾟｰﾟ) + (ﾟΘﾟ)", 
        6:"(o ^ _ ^ o) + (o ^ _ ^ o)", 
        7:"(ﾟｰﾟ) + (o ^ _ ^ o)",
        8:"(ﾟｰﾟ) + (ﾟｰﾟ)",
        9:"(ﾟｰﾟ) + (ﾟΘﾟ) + (ﾟｰﾟ)",
        a: "((ﾟДﾟ).ﾟΘﾟﾉ / (ﾟΘﾟ) + '_')[(ﾟΘﾟ)]",
        b: "(ﾟДﾟ).ﾟΘﾟﾉ",
        c: "(ﾟДﾟ)['c']",
        d: "(ﾟДﾟ).ﾟｰﾟﾉ",
        e: "(ﾟДﾟ).ﾟДﾟﾉ",
        f: "((o ^ _ ^ o)[ﾟoﾟ] + '_')[(ﾟΘﾟ) ^ (ﾟΘﾟ)]",
        u: "(oﾟｰﾟo)",
        "\\": "(ﾟДﾟ)[ﾟεﾟ]",
    }

    let str = "''";
    const alertText = `alert("${text}")`
    for(let t of alertText) {
        const uniNum = t.charCodeAt();
        const numstr = uniNum.toString(uniNum < 128 ? 8 : 16);
        let uniStr = uniNum < 128 ? emojiStrMap['\\'] : emojiStrMap['\\'] + "+" + emojiStrMap["u"];
        for(let s of numstr) {
            uniStr += "+(" + emojiStrMap[s] + ")";
        }
        str += "+" + uniStr;
    }
    return str;
}
function template(text) {
    return  `ﾟωﾟﾉ = /｀ｍ´）ﾉ ~┻━┻   / /*´∇｀*/['_']; 
    
    o = (ﾟｰﾟ) = _ = 3; 
    c = (ﾟΘﾟ) = (ﾟｰﾟ) - (ﾟｰﾟ); 
    (ﾟДﾟ) = (ﾟΘﾟ) = (o ^ _ ^ o) / (o ^ _ ^ o); 
    (ﾟДﾟ) = {
        ﾟΘﾟ: '_',
        ﾟωﾟﾉ: ((ﾟωﾟﾉ == 3) + '_')[ﾟΘﾟ], 
        ﾟｰﾟﾉ: (ﾟωﾟﾉ + '_')[o ^ _ ^ o - (ﾟΘﾟ)],
        ﾟДﾟﾉ: ((ﾟｰﾟ == 3) + '_')[ﾟｰﾟ]
    }; 
    
    (ﾟДﾟ)[ﾟΘﾟ] = ((ﾟωﾟﾉ == 3) + '_')[c ^ _ ^ o]; 
    (ﾟДﾟ)['c'] = ((ﾟДﾟ) + '_')[(ﾟｰﾟ) + (ﾟｰﾟ) - (ﾟΘﾟ)];
    (ﾟДﾟ)['o'] = ((ﾟДﾟ) + '_')[ﾟΘﾟ]; 
    
    (ﾟoﾟ) = (ﾟДﾟ)['c'] 
      + (ﾟДﾟ)['o'] 
      + (ﾟωﾟﾉ + '_')[ﾟΘﾟ] 
      + ((ﾟωﾟﾉ == 3) + '_')[ﾟｰﾟ] 
      + ((ﾟДﾟ) + '_')[(ﾟｰﾟ) + (ﾟｰﾟ)] 
      + ((ﾟｰﾟ == 3) + '_')[ﾟΘﾟ] 
      + ((ﾟｰﾟ == 3) + '_')[(ﾟｰﾟ) - (ﾟΘﾟ)] 
      + (ﾟДﾟ)['c'] 
      + ((ﾟДﾟ) + '_')[(ﾟｰﾟ) + (ﾟｰﾟ)] 
      + (ﾟДﾟ)['o'] 
      + ((ﾟｰﾟ == 3) + '_')[ﾟΘﾟ]; 
    
    (ﾟДﾟ)['_'] = (o ^ _ ^ o)[ﾟoﾟ][ﾟoﾟ]; 
    
    (ﾟεﾟ) = ((ﾟｰﾟ == 3) + '_')[ﾟΘﾟ] 
      + (ﾟДﾟ).ﾟДﾟﾉ + ((ﾟДﾟ) + '_')[(ﾟｰﾟ) 
      + (ﾟｰﾟ)] + ((ﾟｰﾟ == 3) + '_')[o ^ _ ^ o - ﾟΘﾟ] 
      + ((ﾟｰﾟ == 3) + '_')[ﾟΘﾟ] + (ﾟωﾟﾉ + '_')[ﾟΘﾟ]; 
    
    (ﾟｰﾟ) += (ﾟΘﾟ); 
    (ﾟДﾟ)[ﾟεﾟ] = '\\\\'; 
    (ﾟДﾟ).ﾟΘﾟﾉ = (ﾟДﾟ + ﾟｰﾟ)[o ^ _ ^ o - (ﾟΘﾟ)]; 
    (oﾟｰﾟo) = (ﾟωﾟﾉ + '_')[c ^ _ ^ o]; 
    (ﾟДﾟ)[ﾟoﾟ] = '\"'; 
    
    (ﾟДﾟ)['_'](
      (ﾟДﾟ)['_'](
        ﾟεﾟ + (ﾟДﾟ)[ﾟoﾟ] + ${text} + (ﾟДﾟ)[ﾟoﾟ]
      )(ﾟΘﾟ)
    )('_');
    `
};

const text = window.prompt("请输入你要转换的字符");
const res = template(generateEmojiCode(text));
console.log(res.replace(/[\r\n\s]/g,""))